app/Controllers/Admin/TicketController.php

SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT *
FROM `status`
JOIN `tickets` ON `tickets`.`status`=`status`.`id`
SELECT `areas`.`name`
FROM `areas`
JOIN `users` ON `users`.`area` = `areas`.`id`
JOIN `tickets` ON `users`.`id` = `tickets`.`usuario`
SELECT `t`.*, `user`.`name`, `user`.`apaterno`, `user`.`amaterno`, `a`.`name` as `nombrearea`, `status`.`name` as `estado`
FROM `tickets` as `t`
JOIN `users` as `user` ON `t`.`usuario` = `user`.`id`
JOIN `areas` as `a` ON `user`.`area` = `a`.`id`
JOIN `status` ON `t`.`status` = `status`.`id`
ORDER BY `created_at` DESC
---
    public function index()
    {
        helper('date');

        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();
        $tickets2 = model('Ticket');

        $builder = $db->table('status');
        $builder->join('tickets', 'tickets.status=status.id');
        $status = $builder->get();
        // $status = $builder->where('status.id', 'ASC')->get();

        $builder2 = $db->table('areas')->select('areas.name');
        $builder2->join('users', 'users.area = areas.id');
        $builder2->join('tickets', 'users.id = tickets.usuario');
        $usuario = $builder2->get();

        $this->session = \Config\Services::session();

        $builder3 = $this->db->table('tickets as t');
        $builder3->select('t.*, user.name, user.apaterno, user.amaterno, a.name as nombrearea, status.name as estado');
        $builder3->join('users as user', 't.usuario = user.id');
        $builder3->join('areas as a', 'user.area = a.id');
        $builder3->join('status', 't.status = status.id');
        $tickets = $builder3->get()->getResult();

SELECT *
FROM `tickets`
ORDER BY `id` DESC
SELECT COUNT(*) AS `numrows`
FROM `tickets`
---
        /* $numResp = $this->db->table('mensajes')->where('mensajes.ticket_id', $this->ticket->id)->countAllResults();
        $numResp1 = $this->db->table('mensajes');
        $numResp1->select('count(*) as total')->join('mensajes as m', 'm.ticket_id = ' . $this->ticket->id);
        $numResp = $numResp1->get()->getResult();
    */

        $data = [
            'title'     => 'Tickets de soporte',
            'total'     => $total,
            'status'    => $status,
            'tickets2'   => $tickets2->orderBy('id', 'desc')->findAll(),
            'usuario'   => $usuario,
            'tickets' => $tickets,
        ];

SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT *
FROM `status`
JOIN `tickets` ON `tickets`.`status`=`status`.`id`
SELECT `users`.`name`
FROM `users`
JOIN `mensajes` ON `mensajes`.`usuario_id` = `users`.`id`
SELECT `areas`.`name`
FROM `areas`
JOIN `users` ON `users`.`area` = `areas`.`id`
JOIN `tickets` ON `users`.`id` = `tickets`.`usuario`
SELECT `t`.*, `user`.`name`, `user`.`apaterno`, `user`.`amaterno`, `a`.`name` as `nombrearea`, `status`.`name` as `estado`
FROM `tickets` as `t`
JOIN `users` as `user` ON `t`.`usuario` = `user`.`id`
JOIN `areas` as `a` ON `user`.`area` = `a`.`id`
JOIN `status` ON `t`.`status` = `status`.`id`
SELECT *
FROM `tickets`
ORDER BY `id` DESC
---
    public function lista()
    {
        helper('date');

        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();
        $tickets2 = model('Ticket');

        $builder = $db->table('status');
        $builder->join('tickets', 'tickets.status=status.id');
        $status = $builder->get();
        // $status = $builder->where('status.id', 'ASC')->get();

        $builder2 = $db->table('areas')->select('areas.name');
        $builder2->join('users', 'users.area = areas.id');
        $builder2->join('tickets', 'users.id = tickets.usuario');
        $usuario = $builder2->get();

        $this->session = \Config\Services::session();

        $builder3 = $this->db->table('tickets as t');
        $builder3->select('t.*, user.name, user.apaterno, user.amaterno, a.name as nombrearea, status.name as estado');
        $builder3->join('users as user', 't.usuario = user.id');
        $builder3->join('areas as a', 'user.area = a.id');
        $builder3->join('status', 't.status = status.id');
        $tickets = $builder3->get()->getResult();

        $data = [
            'title'     => 'Tickets de soporte',
            'total'     => $total,
            'status'    => $status,
            'tickets2'   => $tickets2->orderBy('id', 'desc')->findAll(),
            'usuario'   => $usuario,
            'tickets' => $tickets,
        ];

SELECT *
FROM `users`
JOIN `mensajes` ON `mensajes`.`usuario_id` = `users`.`id`
SELECT `m`.*, `user`.`name`, `user`.`apaterno`, `user`.`amaterno`
FROM `mensajes` as `m`
JOIN `tickets` as `t` ON `m`.`ticket_id` = `t`.`id`
JOIN `users` as `user` ON `m`.`usuario_id` = `user`.`id`
WHERE `m`.`ticket_id` = 't.id'
ORDER BY `m`.`created_at` ASC
SELECT `m`.*
FROM `mensajes` as `m`
JOIN `tickets` as `t` ON `m`.`ticket_id` = `t`.`id`
ORDER BY `m`.`created_at` DESC
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '80'
---
    public function show($id = null)
    {


        $ticketModel = new Ticket();
        $mensajeModel = new MensajeModel();
        $attachmentModel = new Attachment();
        $adjuntosMensaje = new AdjuntosMensajeModel();


        $db = \Config\Database::connect();

        $builder = $db->table('users')->select('*');
        $builder->join('mensajes', 'mensajes.usuario_id = users.id');
        $usuario = $builder->get();

        /*
        $builder3 = $this->db->table('mensajes as m');
        $builder3->select('m.*, user.name, user.apaterno, user.amaterno');
        $builder3->join('users as user', 'm.usuario_id = ', $this->ticket->id);
        $builder3->orderBy('m.created_at', 'DESC');
        $mensajes0 = $builder3->get()->getResult();
        */

        $builder3 = $this->db->table('mensajes as m');
        $builder3->select('m.*, user.name, user.apaterno, user.amaterno');
        $builder3->join('tickets as t', 'm.ticket_id = t.id');
        $builder3->join('users as user', 'm.usuario_id = user.id');
        $builder3->where('m.ticket_id', 't.id');
        $builder3->orderBy('m.created_at', 'asc');
        $mensajes_anterior = $builder3->get()->getResult();

SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '21'
SELECT *
FROM `mensajes`
WHERE `ticket_id` = '21'
ORDER BY `created_at` ASC
SELECT *
FROM `attachments`
WHERE `ticket_id` = '21'
---

        $data['usuario'] = $usuario;
        $data['ticketId'] = $id;
        $data['ticket'] = $ticketModel->find($id);
        $data['mensajes'] = $mensajeModel->where('ticket_id', $id)->orderBy('created_at', 'asc')->findAll();
        // $data['mensajes'] = $mensajes;
        $data['attachments'] = $attachmentModel->where('ticket_id', $id)->findAll();