app/Controllers/Admin/TicketController.php

SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '8'
SELECT *
FROM `mensajes`
WHERE `ticket_id` = '8'
ORDER BY `created_at` DESC
---
    public function show($id = null)
    {
        $ticketModel = new Ticket();
        $mensajeModel = new MensajeModel();

        $data['ticket'] = $ticketModel->find($id);
        $data['mensajes'] = $mensajeModel->where('ticket_id', $id)->orderBy('created_at', 'DESC')->findAll();

INSERT INTO `mensajes` (`ticket_id`, `mensaje`, `created_at`, `updated_at`) VALUES ('8', 'Ya se está atendiendo su mensaje', '2023-07-22 19:38:55', '2023-07-22 19:38:55')
---
    public function guardarMensaje()
    {
        $mensajeModel = new MensajeModel();

        $data = [
            'ticket_id' => $this->request->getPost('ticket_id'),
            'mensaje'   => $this->request->getPost('mensaje'),
        ];

        $mensajeModel->insert($data);