app/Controllers/Admin/TicketController.php

SELECT `m`.*, `user`.`name`, `user`.`apaterno`, `user`.`amaterno`
FROM `mensajes` as `m`
JOIN `users` as `user` ON `m`.`usuario_id` = `user`.`id`
ORDER BY `m`.`created_at` DESC
---
    public function show($id = null)
    {
        $ticketModel = new Ticket();
        $mensajeModel = new MensajeModel();


        $db = \Config\Database::connect();

        $builder = $db->table('users')->select('users.name');
        $builder->join('mensajes', 'mensajes.usuario_id = users.id');
        $usuario = $builder->get();

        $builder3 = $this->db->table('mensajes as m');
        $builder3->select('m.*, user.name, user.apaterno, user.amaterno');
        $builder3->join('users as user', 'm.usuario_id = user.id');
        $builder3->orderBy('m.created_at', 'DESC');
        $mensajes = $builder3->get()->getResult();