app/Controllers/Usuario/TicketController.php

    public function show($id = null)
    {
        $ticketModel = new Ticket();
        $mensajeModel = new MensajeModel();

        $db = \Config\Database::connect();

        $builder3 = $this->db->table('mensajes as m');
        $builder3->select('m.*, user.name, user.apaterno, user.amaterno');
        $builder3->join('users as user', 'm.usuario_id = user.id');
        $builder3->orderBy('m.created_at', 'DESC');
        $mensajes = $builder3->get()->getResult();

        $data['ticket'] = $ticketModel->find($id);
---
SELECT `m`.*, `user`.`name`, `user`.`apaterno`, `user`.`amaterno`
FROM `mensajes` as `m`
JOIN `users` as `user` ON `m`.`usuario_id` = `user`.`id`
ORDER BY `m`.`created_at` DESC
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '5'

    public function guardarMensaje()
    {
        $mensajeModel = new MensajeModel();

        $this->session = \Config\Services::session();

        $data = [
            'usuario_id'    => $this->session->id,
            'ticket_id'     => $this->request->getPost('ticket_id'),
            'mensaje'       => $this->request->getPost('mensaje'),
        ];

        $mensajeModel->insert($data);
---
INSERT INTO `mensajes` (`usuario_id`, `ticket_id`, `mensaje`, `created_at`, `updated_at`) VALUES ('2', '5', 'Justo necesito su ayuda para resolver esto', '2023-07-22 22:45:46', '2023-07-22 22:45:46')